options = {
    "engine": "2.5 Hybrid",
    "transmission": "Stepless (e-CVT)",
    "year": 2025,
    "color": "grey",
    "model": "Rav4",
    "price": 1_706_387,
    "complectation": {
        "things_transportation": [
            "Чорні глянцеві рейлінги на даху",
            "Два рівні підлоги",
            "Двостороння підлога багажного відділення (килим / пластик)",
            "Кишеня в спинці сидіння переднього пасажира",
            "Тримач для окулярів",
            "Тримачі для пляшок у передній частині салону",
            "Тримачі для пляшок у задній частині авто",
            "Тримачі для стаканів у центральній консолі",
            "Тримачі для стаканів у задній частині авто",
            "Шторка багажного відділення",
        ]
    },
}

for key, value in options.items():
    print(f"{key}: {value}")
