text_pro_kota = (
    "Одного спекотного дня Петро вирішив принести з ринку величезний кавун."
    " \nЩойно він заніс його до кухні, як кіт Барсик сів поруч і з цікавістю витріщився на зелену кулю."
    "\n— Не твій це кавун! — попередив Петро."
    "Та варто було Петрові відвернутися, як Барсик стрибнув на кавун,\n і той покотився по підлозі просто до відчиненого балкона.\nКавун урочисто зник з очей, а кіт, ніби нічого не сталося, сів на підвіконня і почав вилизувати лапу.\nПетро тільки зітхнув:\n— Барсику, ну ти й стратег…"
)
print(
    text_pro_kota.replace("Барсик", "Barsik"),
    f"{text_pro_kota.count("Петро")=}",
    f"{2+2=}",
    sep="\n",
)
